# Brewfile - Homebrew Bundle
# Install all packages with: brew bundle
# Generate from current system: brew bundle dump

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# =============================================================================
# CLI Tools
# =============================================================================

# Essential
brew "git"
brew "wget"
brew "curl"

# Shell & Terminal
brew "zsh"
brew "starship"      # Cross-shell prompt

# Modern Unix tools
brew "eza"           # Modern replacement for ls
brew "bat"           # Cat clone with syntax highlighting
brew "fd"            # Modern replacement for find
brew "ripgrep"       # Fast grep alternative
brew "fzf"           # Fuzzy finder

# Development libraries
brew "hdf5"          # High-performance data management
brew "qt@5"          # Qt framework version 5

# Cloud & DevOps
brew "azure-cli"     # Azure command-line interface

# =============================================================================
# Applications (Casks)
# =============================================================================

# Development
cask "visual-studio-code"
cask "docker"
cask "iterm2"

# Productivity
cask "rectangle"     # Window management
cask "1password"     # Password manager

# Optional - uncomment if needed
# cask "google-chrome"
# cask "firefox"
# cask "slack"
# cask "spotify"
# cask "obsidian"
